11/data/attachments/f8cf3b6000a0ec37.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Justin_material_Friend_56017_6</nif:username>
            <nif:friendToBeRequested>soap_friends_d9d3eed9-e509-469f-aa10-3f2a6f815ba9</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>